Core/src/src/InformationRegisters/УчетнаяПолитикаРегл/УчетнаяПолитикаРегл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаРегл</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>СчетНезавершенноеПроизводство</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>РозничныйКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорРозничногоКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДСРозничныхПродаж</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрибыльУбытки</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДеньгиВПути</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыль</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыльПодлежащийОплате</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортВозвратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетТранзитногоСклада</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ВидНадогаДляСчетовНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДФЛСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратПФСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратВозврат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажа</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажаСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСебестоимостиВозврат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятелности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизациюОтНачальнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьНовуюФормуОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧекККМВозвратПроверкаЗаполненияПоляКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВозвратЗапасовПоСебестоимостиПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>AzRyРозничныйКонтрагентАналитика</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>УчетСебестоимостиВРазрезеОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетСписанияЗапасовРасширение</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПодарокВТабличнойЧасти</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольКоличестваПриВозврате</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокКонтроляКоличестваПриВозврате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РедактированиеСуммыНачисленияВЗаказНарядах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаУправленческая</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетВУпрВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаУчетаПоУпрВалюте</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретАктивированияНепроведенных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВариантЗаполненияРасшифровки</name>
    <type>
      <types>EnumRef.ВариантыЗаполненияРасшифровкиПлатежа</types>
    </type>
  </resources>
  <resources>
    <name>КорректировкаНалоговойДекларацииВоВремяВозвратаАванса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетФактураПолученныйВидНалогаПриСинхронизации</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетФактураПолученныйСчетУчетаПриСинхронизации</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетФактураВыданныйВидНалогаПриСинхронизации</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетФактураВыданныйСчетУчетаПриСинхронизации</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьНовыйАлгоритмАмортизацииЛинейнымСпособом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРеглДоговорЗаймаСотруднику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПроцентовРеглДоговорЗаймаСотруднику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРеглДоговорЗаймаСотруднику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаКомиссииРеглДоговорЗаймаСотруднику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРеглКредитПолученный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПроцентовРеглКредитПолученный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРеглКредитПолученный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаКомиссииРеглКредитПолученный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРеглКредитВыданный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПроцентовРеглКредитВыданный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРеглКредитВыданный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаКомиссииРеглКредитВыданный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретРедактированияЗаписанныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнениеРеквизитовСинхронизацияЭлектронныхТТН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьСчетаВСчетахФактуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PowerBIСтрокаПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PowerBIИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PowerBIПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереноситьКомментарииВСФОтправленные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоступлениеНаСчетСуммаКомиссияИзШапки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачисленныйНДСНаПолученныйАванс</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ОплаченныеКОплатеНДСНаАванс</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ПредворительныйЗачетПолученныйНаВыдааныАванс</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ЗачетПолученногоНДСНаВыданныАванс</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ПроверкаКоличестваПриВозвратеОтПокупателя</name>
    <comment>Paganini ONESOFT-2685</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВозможностьДобавлятьНовыеВидыОтпусков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СобраниеЗапасовВДокументеСборкаЗапасов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РозничныеПродажиАвтоматическиеСкидкиСразу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИзменитьЛогикуСобранияЗапасов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагрузкаВыписок_ОтчетЭквайера_АвтозаполнениеДокументов</name>
    <comment>ONESOFT-3473</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КартыЛояльности_СчетЗатратДляБалловРегл</name>
    <comment>ONESOFT-3507</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДляПредоплаченныхРасходовРегл</name>
    <comment>ONESOFT-3553</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДляНДСнакопленныхБалловРегл</name>
    <comment>ONESOFT-3553</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДляНеоперационныхДоходовОтБалловРегл</name>
    <comment>ONESOFT-3566</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>РозничныйПроект</name>
    <comment>ONESOFT-3670</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ПромежуточныйСчетЗатратДоходовПриВозвратеПоставщику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <attributes>
    <name>СоответствиеПриПоискеНоменклатурВбазе</name>
    <type>
      <types>EnumRef.ПриоритетСоответствияДляПоискаНоменклатурВБазе</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/CommonModules/БезвозмезднаяПродажа/Module.bsl
Процедура ЗаполнитьСчетаБезвозмезднойПродажи(Объект) Экспорт
	
	СтруктураСчетовКурсРазниц = РегистрыСведений.УчетнаяПолитикаРегл.СоздатьМенеджерЗаписи();
	СтруктураСчетовКурсРазниц.Организация = ?(НЕ ЗначениеЗаполнено(Объект.Организация), УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация"), Объект.Организация);
	СтруктураСчетовКурсРазниц.Период = ?(НЕ ЗначениеЗаполнено(Объект.Дата), ТекущаяДата(),ОБъект.Дата);
	СтруктураСчетовКурсРазниц.Прочитать();
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Объект.СчетЗатратБезвозмезднойПродажи 			 = СтруктураСчетовКурсРазниц.СчетЗатратБезвозмезднойПродажи;
		Объект.СчетЗатратНДСБезвозмезднойПродажи   		 = СтруктураСчетовКурсРазниц.СчетЗатратНДСБезвозмезднойПродажи;
		Объект.СчетУчетаНалогаНаПрибыль     			 = СтруктураСчетовКурсРазниц.СчетУчетаНалогаНаПрибыль;
		Объект.СчетУчетаНалогаНаПрибыльПодлежащийОплате  = СтруктураСчетовКурсРазниц.СчетУчетаНалогаНаПрибыльПодлежащийОплате;
		Объект.СчетУчетаСвободнаяпродажа                 = СтруктураСчетовКурсРазниц.СчетУчетаСвободнаяпродажа;
		
		Объект.СчетЗатратБезвозмезднойПродажиСотрудник 	 = СтруктураСчетовКурсРазниц.СчетЗатратБезвозмезднойПродажиСотрудник;
		Объект.СчетЗатратНДСБезвозмезднойПродажиСотрудник= СтруктураСчетовКурсРазниц.СчетЗатратНДСБезвозмезднойПродажиСотрудник;
		Объект.СчетЗатратНДФЛСотрудник     				 = СтруктураСчетовКурсРазниц.СчетЗатратНДФЛСотрудник;
		Объект.СчетЗатратПФСотрудник					 = СтруктураСчетовКурсРазниц.СчетЗатратПФСотрудник;
		Объект.СчетУчетаСвободнаяпродажаСотрудник        = СтруктураСчетовКурсРазниц.СчетУчетаСвободнаяпродажаСотрудник;
		
	Иначе
		
		ПустойСчет = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка");
		Объект.СчетЗатратБезвозмезднойПродажи 			= ПустойСчет;
		Объект.СчетЗатратНДСБезвозмезднойПродажи 		= ПустойСчет;
		Объект.СчетУчетаНалогаНаПрибыль 				= ПустойСчет;
		Объект.СчетУчетаНалогаНаПрибыльПодлежащийОплате = ПустойСчет;
		Объект.СчетУчетаСвободнаяпродажа                = ПустойСчет;
		
		Объект.СчетЗатратБезвозмезднойПродажиСотрудник 	 = ПустойСчет;
		Объект.СчетЗатратНДСБезвозмезднойПродажиСотрудник= ПустойСчет;
		Объект.СчетЗатратНДФЛСотрудник     				 = ПустойСчет;
		Объект.СчетЗатратПФСотрудник					 = ПустойСчет;
		
	КонецЕсли;
	
КонецПроцедуры
